app/Controllers/Home.php

    public function roky()
    {
        // Získání unikátních roků z databáze
        $builder = $this->race_year->builder();
        $query = $builder->select('year')
                        ->distinct()
                        ->orderBy('year', 'DESC')
                        ->get();
---
SELECT DISTINCT `year`
FROM `race_year`
ORDER BY `year` DESC

    public function hlavniStranka($rok)
    {
        $data["zavodyZenskeKategorie"] = $this->race_year->where('sex', 'W')->where("year",$rok)->findAll();
---
SELECT *
FROM `race_year`
WHERE `sex` = 'W'
AND `year` = '2022'

    public function pridaniZavodu()
    {
        helper('form');
        $data["zavodyZenskeKategorie"] = $this->race_year->select('country')->where('sex', 'W')->orderBy('country', 'asc')->groupBy('country')->get()->getResult();
---
SELECT `country`
FROM `race_year`
WHERE `sex` = 'W'
GROUP BY `country`
ORDER BY `country` ASC