app/Controllers/Home.php

SELECT *
FROM `race_year`
WHERE `sex` = 'W'
---
    public function hlavniStranka()
    {
        $data["zavodyZenskeKategorie"] = $this->race_year->where('sex', 'W')->findAll();